ekkus93/esp32_btaudio/esp_i2s_source/sdkconfig.defaults
# esp_i2s_source defaults — ESP32-S3-WROOM-1 N16R8 (16 MB flash, 8 MB octal PSRAM)
# See docs/SPEC.md §2 (locked decisions) and §6 (memory budget).

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# --- Octal PSRAM (N16R8 = 8 MB, octal mode) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- Console on native USB-Serial-JTAG ---
# The devkit is connected via its USB port (/dev/ttyACM0), so route the
# console there rather than UART0. Revisit if the CP2102 UART port is used.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- HTTP server WebSocket support (web_ui, WEB-1) ---
CONFIG_HTTPD_WS_SUPPORT=y

# --- More lwIP sockets. The default 10 is exhausted by the radio HTTPS stream +
#     APSTA DHCP + mDNS + the httpd (browser holds a WebSocket AND polls
#     /api/status), which resets new WebSocket handshakes -> the terminal/BT UI
#     breaks while music is playing. 16 (the max) gives headroom. ---
CONFIG_LWIP_MAX_SOCKETS=16

# --- Dynamic mbedTLS buffers. Without this, every HTTPS connection pins a
#     ~16 KB internal-RAM RX buffer for its whole lifetime. During an https://
#     radio stream that squeezes the internal (DMA-capable) heap so hard that
#     the WiFi driver's dynamic TX buffers can't allocate, and the web server's
#     concurrent page sends stall with EAGAIN (no alloc-failure logged) -> the
#     web UI hangs while an HTTPS station plays, but not an HTTP one. Enabling
#     dynamic TX/RX buffers frees that RAM when idle. Measured on-device: under
#     an HTTPS-AAC stream, largest free DMA block ~3-7 KB -> ~10-11 KB, and a
#     10-concurrent page-load storm went 0/10 -> 10/10 (HTTP was 10/10 either
#     way). See memory.md 2026-07-25. ---
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# --- Partition table: bigger app for TLS + decoders; larger NVS for presets ---
# (RADIO-1b) Default single-app ~1 MB is too small once esp_http_client +
# esp-tls + the mbedtls cert bundle link in. See partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
